-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Фев 11 2020 г., 11:50
-- Версия сервера: 8.0.13-4
-- Версия PHP: 7.2.24-0ubuntu0.18.04.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `BpHhTy1dfD`
--

USE `B5hw25qJZT`;

-- --------------------------------------------------------

--
-- Структура таблицы `messeges`
--

CREATE TABLE `messeges` (
  `id` int(11) NOT NULL,
  `id_name` int(11) NOT NULL,
  `name` text NOT NULL,
  `messege` text NOT NULL,
  `color` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `messeges`
--

INSERT INTO `messeges` (`id`, `id_name`, `name`, `messege`, `color`) VALUES
(606, 213, 'admin', 'чат пуст', 'rgba(191, 22, 54, 0.5)'),
(608, 213, 'admin', 'на компе лучше ', 'rgba(191, 22, 54, 0.5)'),
(610, 223, 'Alena', 'Я не могу ', 'rgba(188, 82, 135, 0.5)'),
(612, 213, 'admin', 'Я зашёл ', 'rgba(191, 22, 54, 0.5)'),
(613, 213, 'admin', 'ха', 'rgba(191, 22, 54, 0.5)'),
(614, 213, 'admin', 'я потом сделаю', 'rgba(191, 22, 54, 0.5)'),
(615, 213, 'admin', 'hi', 'rgba(191, 22, 54, 0.5)'),
(616, 229, 'илья', '???', 'rgba(213, 94, 43, 0.5)'),
(617, 218, '1', 'Хаха', 'rgba(117, 40, 117, 0.5)'),
(618, 229, 'илья', 'хахах', 'rgba(213, 94, 43, 0.5)'),
(619, 218, '1', 'Че давай топ 1', 'rgba(117, 40, 117, 0.5)'),
(620, 218, '1', 'Пробел ', 'rgba(117, 40, 117, 0.5)'),
(621, 218, '1', 'Прыгать ', 'rgba(117, 40, 117, 0.5)'),
(622, 213, 'admin', 'или стрелочка вверх', 'rgba(191, 22, 54, 0.5)'),
(623, 213, 'admin', 'кароче когда ставишь новый рекорд в чат не пишется(((', 'rgba(191, 22, 54, 0.5)'),
(624, 213, 'admin', 'надо пофиксить будет', 'rgba(191, 22, 54, 0.5)'),
(625, 228, 'roma', 'my result:1954', 'rgba(44, 197, 75, 0.5)'),
(626, 213, 'admin', 'обнови', 'rgba(191, 22, 54, 0.5)'),
(627, 213, 'admin', 'страничку', 'rgba(191, 22, 54, 0.5)'),
(628, 213, 'admin', 'тебя не видно в онлайне', 'rgba(191, 22, 54, 0.5)'),
(629, 213, 'admin', 'рома', 'rgba(191, 22, 54, 0.5)'),
(630, 228, 'roma', 'всё', 'rgba(44, 197, 75, 0.5)'),
(631, 229, 'илья', 'маленько рекорд', 'rgba(213, 94, 43, 0.5)'),
(639, 229, 'илья', 'не я все', 'rgba(213, 94, 43, 0.5)'),
(640, 213, 'admin', 'да', 'rgba(191, 22, 54, 0.5)'),
(641, 213, 'admin', 'я вижу', 'rgba(191, 22, 54, 0.5)'),
(642, 213, 'admin', 'none', 'rgba(191, 22, 54, 0.5)'),
(643, 213, 'admin', 'хм', 'rgba(191, 22, 54, 0.5)'),
(644, 213, 'admin', 'я всё вижу', 'rgba(191, 22, 54, 0.5)'),
(645, 213, 'admin', 'g', 'rgba(191, 22, 54, 0.5)'),
(647, 213, 'admin', 'кароче тут чат', 'rgba(191, 22, 54, 0.5)'),
(648, 213, 'admin', 'чекнуть онайлн можно', 'rgba(191, 22, 54, 0.5)'),
(649, 213, 'admin', 'никто не играет(((', 'rgba(191, 22, 54, 0.5)'),
(650, 224, 'Login', 'Капец, я не могу перепрыгнуть первый камень', 'rgba(57, 254, 45, 0.5)'),
(651, 213, 'admin', 'НАТСЯ   с телефона там не перепрыгнуть   ((\\', 'rgba(191, 22, 54, 0.5)'),
(652, 233, '123', 'скучно', 'rgba(176, 85, 68, 0.5)'),
(653, 213, 'admin', 'хм', 'rgba(191, 22, 54, 0.5)'),
(654, 213, 'admin', 'а че добавить', 'rgba(191, 22, 54, 0.5)'),
(655, 213, 'admin', '?', 'rgba(191, 22, 54, 0.5)'),
(656, 213, 'admin', 'я думал дабл джапм', 'rgba(191, 22, 54, 0.5)'),
(657, 213, 'admin', 'магазин', 'rgba(191, 22, 54, 0.5)'),
(658, 213, 'admin', 'типа', 'rgba(191, 22, 54, 0.5)'),
(659, 233, '123', 'ну да', 'rgba(176, 85, 68, 0.5)'),
(660, 233, '123', 'ну сам процесс не затягивает как со слотами', 'rgba(176, 85, 68, 0.5)'),
(661, 213, 'admin', 'ну я уже понял(', 'rgba(191, 22, 54, 0.5)'),
(662, 233, '123', 'хммм', 'rgba(176, 85, 68, 0.5)'),
(663, 233, '123', 'почему то у меня пароль ', 'rgba(176, 85, 68, 0.5)'),
(664, 233, '123', 'вместо имени', 'rgba(176, 85, 68, 0.5)'),
(665, 213, 'admin', 'хахах', 'rgba(191, 22, 54, 0.5)'),
(666, 213, 'admin', 'лол', 'rgba(191, 22, 54, 0.5)'),
(667, 233, '123', 'я типа с телефона еще когда вводил он как пароль спрашивал', 'rgba(176, 85, 68, 0.5)'),
(668, 233, '123', 'предлогал', 'rgba(176, 85, 68, 0.5)'),
(669, 213, 'admin', 'это имя ', 'rgba(191, 22, 54, 0.5)'),
(670, 213, 'admin', 'такое', 'rgba(191, 22, 54, 0.5)'),
(671, 213, 'admin', 'а ты по логину заходил', 'rgba(191, 22, 54, 0.5)'),
(672, 213, 'admin', 'хз', 'rgba(191, 22, 54, 0.5)'),
(673, 233, '123', 'чекни вк', 'rgba(176, 85, 68, 0.5)'),
(674, 233, '123', 'ускорение добавь на стрелочку вправо', 'rgba(176, 85, 68, 0.5)'),
(675, 213, 'admin', 'ускорение равномерное', 'rgba(191, 22, 54, 0.5)'),
(676, 213, 'admin', 'с количеством очков', 'rgba(191, 22, 54, 0.5)'),
(677, 213, 'admin', 'растет', 'rgba(191, 22, 54, 0.5)'),
(678, 237, 'Yung', 'аааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааа', 'rgba(43, 80, 241, 0.5)'),
(679, 237, 'Yung', 'оторвите руки артему', 'rgba(43, 80, 241, 0.5)'),
(681, 213, 'admin', 'че', 'rgba(191, 22, 54, 0.5)'),
(682, 213, 'admin', 'кук', 'rgba(191, 22, 54, 0.5)'),
(683, 213, 'admin', 'у', 'rgba(191, 22, 54, 0.5)'),
(684, 213, 'admin', 'ой ', 'rgba(191, 22, 54, 0.5)'),
(685, 213, 'admin', 'баг нашел', 'rgba(191, 22, 54, 0.5)'),
(686, 237, 'Yung', 'ебанутая заскриптованная хуйня', 'rgba(43, 80, 241, 0.5)'),
(687, 213, 'admin', ')((9', 'rgba(191, 22, 54, 0.5)'),
(688, 213, 'admin', 'че', 'rgba(191, 22, 54, 0.5)'),
(689, 237, 'Yung', 'почему от гугла норм все', 'rgba(43, 80, 241, 0.5)'),
(690, 237, 'Yung', 'а тут блять ', 'rgba(43, 80, 241, 0.5)'),
(691, 213, 'admin', 'где?', 'rgba(191, 22, 54, 0.5)'),
(692, 213, 'admin', 'ты о чем', 'rgba(191, 22, 54, 0.5)'),
(693, 237, 'Yung', 'подбегать почти в упор надо', 'rgba(43, 80, 241, 0.5)'),
(694, 237, 'Yung', 'почемууууууууууу', 'rgba(43, 80, 241, 0.5)'),
(695, 213, 'admin', 'ты с компа?', 'rgba(191, 22, 54, 0.5)'),
(696, 213, 'admin', 'у меня все норм', 'rgba(191, 22, 54, 0.5)'),
(697, 213, 'admin', 'просто', 'rgba(191, 22, 54, 0.5)'),
(698, 213, 'admin', 'на телефонах не очень работает ', 'rgba(191, 22, 54, 0.5)'),
(699, 237, 'Yung', 'с компа', 'rgba(43, 80, 241, 0.5)'),
(700, 237, 'Yung', 'с компа яяяяя', 'rgba(43, 80, 241, 0.5)'),
(701, 237, 'Yung', 'я', 'rgba(43, 80, 241, 0.5)'),
(702, 237, 'Yung', 'я', 'rgba(43, 80, 241, 0.5)'),
(703, 237, 'Yung', 'яя', 'rgba(43, 80, 241, 0.5)'),
(704, 237, 'Yung', 'я', 'rgba(43, 80, 241, 0.5)'),
(705, 237, 'Yung', 'я', 'rgba(43, 80, 241, 0.5)'),
(706, 237, 'Yung', 'я', 'rgba(43, 80, 241, 0.5)'),
(707, 237, 'Yung', 'яя', 'rgba(43, 80, 241, 0.5)'),
(708, 213, 'admin', 'ну тупа когда уже 100 очков есть', 'rgba(191, 22, 54, 0.5)'),
(709, 213, 'admin', 'изи', 'rgba(191, 22, 54, 0.5)'),
(710, 213, 'admin', 'прыгается', 'rgba(191, 22, 54, 0.5)'),
(711, 213, 'admin', 'согласен', 'rgba(191, 22, 54, 0.5)'),
(712, 213, 'admin', 'не всегда в начале получается ', 'rgba(191, 22, 54, 0.5)'),
(713, 213, 'admin', 'перепрыгнуть((', 'rgba(191, 22, 54, 0.5)'),
(714, 213, 'admin', 'хз я научился', 'rgba(191, 22, 54, 0.5)'),
(715, 213, 'admin', 'уже', 'rgba(191, 22, 54, 0.5)'),
(716, 213, 'admin', 'аха', 'rgba(191, 22, 54, 0.5)'),
(717, 237, 'Yung', 'даааа', 'rgba(43, 80, 241, 0.5)'),
(718, 237, 'Yung', 'там ', 'rgba(43, 80, 241, 0.5)'),
(719, 237, 'Yung', 'типо первые сто оч сложно', 'rgba(43, 80, 241, 0.5)'),
(720, 237, 'Yung', 'а потом изи', 'rgba(43, 80, 241, 0.5)'),
(721, 237, 'Yung', 'почему так', 'rgba(43, 80, 241, 0.5)'),
(722, 213, 'admin', 'несбалансированно ', 'rgba(191, 22, 54, 0.5)'),
(723, 213, 'admin', 'хз', 'rgba(191, 22, 54, 0.5)'),
(724, 213, 'admin', 'надо вот как раз  тестить ', 'rgba(191, 22, 54, 0.5)'),
(725, 213, 'admin', 'и фиксить', 'rgba(191, 22, 54, 0.5)'),
(726, 237, 'Yung', 'фикси', 'rgba(43, 80, 241, 0.5)'),
(727, 213, 'admin', 'я хз ', 'rgba(191, 22, 54, 0.5)'),
(728, 213, 'admin', 'как', 'rgba(191, 22, 54, 0.5)'),
(729, 213, 'admin', 'но илюха зашел', 'rgba(191, 22, 54, 0.5)'),
(730, 213, 'admin', 'и со второго раза', 'rgba(191, 22, 54, 0.5)'),
(731, 213, 'admin', 'поставил рекорд', 'rgba(191, 22, 54, 0.5)'),
(732, 213, 'admin', '2153', 'rgba(191, 22, 54, 0.5)'),
(733, 213, 'admin', 'который', 'rgba(191, 22, 54, 0.5)'),
(734, 237, 'Yung', 'да блчть он ненормальный', 'rgba(43, 80, 241, 0.5)'),
(735, 213, 'admin', '0_о', 'rgba(191, 22, 54, 0.5)'),
(736, 237, 'Yung', 'Я ПЕРВОЕ НЕ МОГУ ПРОЙТИ', 'rgba(43, 80, 241, 0.5)'),
(737, 213, 'admin', 'изи', 'rgba(191, 22, 54, 0.5)'),
(738, 213, 'admin', 'я спокойно', 'rgba(191, 22, 54, 0.5)'),
(739, 213, 'admin', 'наловчился', 'rgba(191, 22, 54, 0.5)'),
(740, 213, 'admin', 'пока делал', 'rgba(191, 22, 54, 0.5)'),
(741, 213, 'admin', ')))))', 'rgba(191, 22, 54, 0.5)'),
(742, 213, 'admin', 'ну такое получилось..', 'rgba(191, 22, 54, 0.5)'),
(743, 213, 'admin', 'не очень затягивающая ', 'rgba(191, 22, 54, 0.5)'),
(744, 213, 'admin', 'как предыдущая ))0', 'rgba(191, 22, 54, 0.5)'),
(745, 213, 'admin', 'игрушка', 'rgba(191, 22, 54, 0.5)'),
(746, 237, 'Yung', 'сделал бы норм прыжки', 'rgba(43, 80, 241, 0.5)'),
(747, 237, 'Yung', 'и чтобы уворачиваться надо было', 'rgba(43, 80, 241, 0.5)'),
(748, 237, 'Yung', 'аааааааааааааааааааааа', 'rgba(43, 80, 241, 0.5)'),
(749, 237, 'Yung', 'аааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааа', 'rgba(43, 80, 241, 0.5)'),
(751, 237, 'Yung', 'пока', 'rgba(43, 80, 241, 0.5)'),
(752, 238, 'a', 'gr', 'rgba(89, 197, 78, 0.5)');

-- --------------------------------------------------------

--
-- Структура таблицы `settings`
--

CREATE TABLE `settings` (
  `maxOnline` int(11) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `settings`
--

INSERT INTO `settings` (`maxOnline`, `id`) VALUES
(3, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `login` text NOT NULL,
  `name` text NOT NULL,
  `password` text NOT NULL,
  `color` text NOT NULL,
  `points` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `name`, `password`, `color`, `points`) VALUES
(205, 'artmiptv', 'Artem Ipatov', '$2b$10$l/J4RZ717ntpDEV98vRjI.WVo4k53ogV1Xb.E/kXD8XV9zeHz9gCa', 'rgba(209, 185, 29, 0.5)', 259),
(213, 'admin', 'admin', '$2b$10$C7Nweq6CPTHHZ9R9bkEtyeMvq10QP13ptusuWYxvt2VMtEjpnxE.m', 'rgba(191, 22, 54, 0.5)', 6666),
(214, 'Твой господин', 'Твой господин', '$2b$10$7tQhCQkYoPCA3twFVtOsS.bnHexWtVG0T/dS6UyCC4.BwDN5CxEae', 'rgba(85, 141, 12, 0.5)', 0),
(221, 'aee.icecreamy', 'Rustam', '$2b$10$YdOFmwJxjH5RTlUwi/Yno.N8QB7zFQgXVSCTWqpCBJret2XsPlmK6', 'rgba(17, 125, 72, 0.5)', 0),
(222, '@lonka', '111', '$2b$10$4pqBi4Nj57Ilhqp6DsS7J.7R5.Lt8Fd4uFwW0JY4OQzxi9m9Fbx1u', 'rgba(79, 190, 187, 0.5)', 0),
(223, 'alena', 'Alena', '$2b$10$NJQdIuvb9NKWA3VawmVpquN0OVxiDUGLx88GOw6XUOYgGrB3NAC8u', 'rgba(188, 82, 135, 0.5)', 924),
(224, 'Login', 'Login', '$2b$10$FyupPp8PwbRfuJzKeaqj/evkGN85S8EmMAO6waryfgwQ6oY0TvrC2', 'rgba(57, 254, 45, 0.5)', 132),
(228, 'roma', 'roma', '$2b$10$5IElit.usw1bXK6Bg.0dze.zaouT0nX/KwPQgnv/F7SVUKk1naYl.', 'rgba(44, 197, 75, 0.5)', 1954),
(229, 'molochnik', 'илья', '$2b$10$Xh6ghp5FM5Ef63w9.73Sc.IraVn9.q8K.9n.MnOiiw5jHRlPxO0/C', 'rgba(213, 94, 43, 0.5)', 2153),
(233, 'Дима', '123', '$2b$10$JDsipvJA8rvlqmPnMl1YGeN1Oq8idJl5iG3NJc1O96/nuAs.Pm1M.', 'rgba(176, 85, 68, 0.5)', 124),
(234, 'Lol', 'Lipa', '$2b$10$wwYCFMkXD9xSOFDK08N9ceaGvu1mUOA2.DvRFtbv4Rlb.nzAOh8aW', 'rgba(224, 20, 96, 0.5)', 48),
(235, 'Furfer', 'gjk2197310', '$2b$10$OGwTnFgLx9gPj.AeQtJiLuRJUEcE6BRLzHDcHc0F3knhPdwBriLSO', 'rgba(6, 181, 168, 0.5)', 116),
(236, 'Yung net bl9t`  old', 'lean w codein', '$2b$10$BmolYR9vMDXjvtPlrbHU2.GqKT6NlWA38cPO5e0bFTPLre.xXOVde', 'rgba(199, 139, 219, 0.5)', 0),
(237, 'Yung', 'Yung', '$2b$10$kgKb4k0gLEsSKMz1E.0F4eWESSnYIFkjBXUvNTwh7VNfjG4q9FcTG', 'rgba(43, 80, 241, 0.5)', 250),
(238, 'a', 'a', '$2b$10$FZ8l4c/P1bO0pgOu4cIS7.EceRrC6jNxjFm2AdaGGW.NDDamRbeXS', 'rgba(89, 197, 78, 0.5)', 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `messeges`
--
ALTER TABLE `messeges`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `messeges`
--
ALTER TABLE `messeges`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=753;

--
-- AUTO_INCREMENT для таблицы `settings`
--
ALTER TABLE `settings`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=239;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
